import { useQuery } from '@tanstack/react-query'
import axios from 'axios'
import React from 'react'

// انا هنا كده بعمل هوك مش موجود عندي قبل كده بعمل فايل بخليه يبدء بكلمه يوز بس باكستنيشن 
// باخد الفنكشون بتاعت ال ايه بي اي باليوز كويري وبعدها بعمل ريترن بالحاجات اللي كنت واخدها من اليوز كويري
// بعد كده هستخدم اليوز ايه بي اي ف الهوم عندي عادي جدا وهعمل اينبورت وهديستركت منه الحاجات اللي بستخدمها من اليوز كويري 
// هعمل انبورت لليوز كويري والاكسيوس
//====انا بعمل كل ده ليه بفصل ليه بفصل عشان الداتا بعد كده هتعمنل مع بروجكت جديد اسمه اي كوميرس مش هقعد كل شويه اعمل فنكشون لل ايه بي اي اللي هيتغير بس الايند بوينت هبعت لل ايند بويت بروبس لل ايه بي اي التاني بس بدل معمل فنكشون لل ايه بي اي تاني=======//

export default function useApi() {
// Tanstack Query ==> Method ==> ( fetchin Data mn 4ier mact5dm useEffect , Handle Error & Loading mn 4ier mact5dm useState , Caching ==> اني الداتا عندي تتخزن تفضل موجوده , Automatic Refetch ==> لو الداتا حصل فيها تغيير الكويري بتحس وبتعرض الداتا بعد ميحصل فيها تغيير , Sharing Data ==> زي كونتكست داتا  )
// دي بكدج خارجيه بنزلها 
// بعمل رترن لما بعمل ال ايه بي اي عشان اهندل الايرور واللودينج

function getAllPost(){
 return axios.get('https://route-posts.routemisr.com/posts' , {
    // params: {sort:'createdAt'} , // هنا كده بيجيبلي الداتا القديمه الاول
    headers : {
      Authorization : `Bearer ${localStorage.getItem('userToken')}`
    }
  })
}

// Tanstack Query ==> بستخدم هوك اسمه يوز كويري وبحط جواه حاجتين او اكتر عادي كويري كي واسميه اي حاجه وكويري فنكشون دي الكول بتاعت ال ايه بي اي
// بيرجعلي اوبجكت بيبقي شايلي الحاجات دي
//isFetched ==> الداتا جاتلي ولا لسه , isFetching ==> دي الداتا اللي لسه بيعملها فتشينج
let {data , error , isError , isLoading , isFetched , isFetching} = useQuery({
  queryKey : ['getPosts'] , 
  queryFn : getAllPost ,
  // staleTime : 3000 ,  // هنا كده انا بقولو اني الداتا دي هتقعد تلت ثواني وبعد كده هتبقي قديمه
  // retry : 3 , // هنا كده لو حصل ايرور انا هنا بحدد يحاول كام مره يعمل ريكوست ويحاول قبل ميعرض الايرور وممكن يزود مره عادي
  // retryDelay : 3000  // انا هنا كده بقولو اني ياخد تلت ثواني ما بين كل ريكوست
  // refetchInterval : 3000 , // دي بتخلي الريكوست يتنفذ كل 3 ثواني يعني كده الفيتش كل شويه هيتغير ب 1 يعني الداتا لسه موصلتش الزيرو يعني وصلت بيبان ف الديفتوولز الاييقونه بتاعت النخله تحت
  // refetchIntervalInBackground: false // هنا كده لو عايز اشوف حاله الريكوست بتاعي هفتح الانسبكت وبعدها النتوورك  ولو روحت اي تاب تانيه ورجعت تاني بيوقف الركوست مبيخلهوش يعمل ريكوست تاني غير وانا واقف ف نفس الصفحه
  select : (res)=> res?.data.data.posts // [{}]  //هنا كده السلكت هنا جتر وسيتر هنا كده بتخزن مكان الداتا اللي فوق اللي راجعه من اوبجكت اليوز كويري بتخزن جواه الكلام ده وبعدها بنعرض الداتا بس عشان هي كده خلاص الريس دوت داتا دوت داتا دوت بوستس اتحفظت جواها خلاص بتبقي جيتر لما بتبعت للداتا فوق وتخزن الحاجات اللي قالتلها عليها وسيتر لما نعمل ريترن بالحاجات دي اللي هي بعد معملنا الارو فنكشون عملنا ريترن
})

return {data , error , isError , isLoading , isFetched , isFetching}

}
